{
  "This game taught me about the diversity of cultures that our small little corner of the universe offers.  Then it taught me to hate them all.": "Game ini mengajari saya tentang keragaman budaya yang ditawarkan oleh sudut kecil alam semesta kecil kami. Kemudian itu mengajari saya untuk membenci mereka semua.",
  "The game is wonderful and very kind to beginners... While they are in the menu.  The community is not only positive, but also has telepathic skills. They told me that my dad wasn't really my dad, and my mom wasn't working where I thought she was.  Also, one of the advantages is that there are many doctors playing Dota 2 and they can easily diagnose your mental and physical abilities.": "Permainan ini luar biasa dan sangat baik untuk pemula ... saat mereka berada di menu. Komunitas ini tidak hanya positif, tetapi juga memiliki keterampilan telepati. Mereka mengatakan kepada saya bahwa ayah saya bukan ayah saya, dan ibu saya tidak bekerja di tempat yang saya pikirkan. Juga, salah satu keuntungannya adalah ada banyak dokter yang bermain Dota 2 dan mereka dapat dengan mudah mendiagnosis kemampuan mental dan fisik Anda.",
  "This game is like an abusive ex. You know the relationship you have with them is toxic but you keep coming back thinking that this time would be different.": "Game ini seperti mantan yang kasar. Anda tahu hubungan yang Anda miliki dengan mereka beracun tetapi Anda terus berpikir bahwa kali ini akan berbeda.",
  "Отличная игра в которой тебе всё расскажут и даже не только про игру! Ты узнаешь о необычных работах своих родственников, о том насколько много людей любит и обожает твою маму. Также один из плюсов это большой выбор героев с не сложным управлением. Например Invoker очень легкий персонаж с кучей урона подходящий для поднятия рейтинга. Комьюнити очень хорошее, иногда встречаются игроки которые настолько хорошо играют, что ломают все свои вещи и собирают новые так как хотят дать фору врагам. Также разработчики очень усердно работают над обновлениями которые выходят раз в полгода и выпускаются для того чтобы онлайн повысился с 10 человек до 11 ( при этом в игру зашел сам разработчик). Ну в целом плюсы перечислять можно долго, а вот насчет минусов, их нет. Спасибо за внимание, надеюсь этот отзыв поможет читающим!": "Permainan hebat di mana semuanya akan diceritakan dan tidak hanya tentang permainan! Anda akan belajar tentang pekerjaan kerabat Anda yang tidak biasa, tentang berapa banyak orang yang mencintai dan mencintai ibu Anda. Juga, salah satu plus adalah banyak pilihan pahlawan dengan kontrol yang tidak rumit. Misalnya, Invoker adalah karakter yang sangat ringan dengan banyak kerusakan yang cocok untuk menaikkan peringkat. Komunitas ini sangat bagus, kadang - kadang pemain ditemukan yang bermain sangat baik sehingga mereka merusak semua barang mereka dan mengumpulkan yang baru karena mereka ingin memberikan peluang kepada musuh. Juga, para pengembang sangat sulit untuk mengerjakan pembaruan yang keluar setiap enam bulan dan diproduksi sehingga online meningkat secara online (sementara pengembang itu sendiri masuk ke dalam permainan). Nah, secara umum, plus dapat terdaftar untuk waktu yang lama, tetapi tentang minus, mereka tidak. Terima kasih atas perhatian Anda, saya harap ulasan ini akan membantu pembaca!",
  "I only played this because League of Legends put me in timeout for telling a 13-year-old jungler to uninstall their soul.    Let me set the scene: it was a dark, shameful day. Riot Games had finally pulled the plug on my main account after a small misunderstanding involving ten ping spams, three racial slurs (none mine!), and one elo-defining loss. So what did I do? Reflect? Seek therapy? Touch grass?    No. I rebounded hard—straight into the open, masochistic arms of Dota 2.    And let me tell you: it was like crawling out of a frat house fight pit and stumbling into a sadistic chess tournament being played by Russian AIs with gambling addictions. This isn’t a game. It’s a graduate-level course in suffering, delivered exclusively through slurs, spreadsheets, and a mini-map that actively gaslights you.    You think League is toxic? Dota 2 players don’t flame you—they curse your bloodline. A Peruvian witch doctor once told me to feed my courier to Roshan and then die in real life. I didn’t even know what a courier was yet. Beautiful.    The learning curve? Imagine climbing Mount Everest, but it's vertical, on fire, and halfway up someone throws a techies minefield at your crotch. Every character has 42 active abilities, a secret satanic pact, and a passive-aggressive Reddit community explaining why you're doing it all wrong. There’s no “meta”—there’s only pain, and ten dudes yelling in five languages about “item timings” while your tower disintegrates like your self-esteem.    But oh, the complexity. The strategy. The high you get from landing a five-man black hole or denying a creep like a smug little Victorian landlord. I once got a triple kill with a flaming horseman while being coached mid-game by a Russian with a drinking problem and a heart of gold. It was the most bonding I’ve experienced since my parents’ divorce.    And the graphics? It looks like a Warhammer figurine collection got possessed by Satan and reanimated using Valve’s leftover Half-Life particles. Every match feels like a beautiful fever dream inside a burning cathedral.    Final Thoughts:  Dota 2 is the game you play when you’ve hit rock bottom in League and decided to dig deeper. It doesn’t hold your hand. It rips your hand off, feeds it to a jungle creep, and then blames you for feeding. It’s brutal, exhilarating, and almost certainly responsible for 12% of global blood pressure medication sales.    I came here because I was banned.  I stayed because the voices in my head said \"GLHF.\"    10/10. Would flame myself again.": "Saya hanya memainkan ini karena League of Legends menempatkan saya di timeout karena memberi tahu seorang jungler berusia 13 tahun untuk menghapus jiwa mereka. Biarkan saya mengatur adegan: itu adalah hari yang gelap dan memalukan. Riot Games akhirnya menarik steker pada akun utama saya setelah kesalahpahaman kecil yang melibatkan sepuluh spam ping, tiga penghinaan rasial (tidak ada tambang!), Dan satu kerugian yang mendefinisikan elo. Jadi apa yang saya lakukan? Mencerminkan? Mencari terapi? Sentuh rumput? Tidak. Saya rebound keras langsung ke lengan terbuka dan masokis Dota 2. Dan izinkan saya memberi tahu Anda: itu seperti merangkak keluar dari lubang pertarungan rumah dan tersandung ke dalam turnamen catur sadis yang dimainkan oleh AIS Rusia dengan kecanduan perjudian. Ini bukan permainan. Ini adalah kursus tingkat pascasarjana dalam penderitaan, disampaikan secara eksklusif melalui cercaan, spreadsheet, dan peta mini yang secara aktif menyalakan Anda. Anda pikir liga beracun? Pemain Dota 2 tidak menyalakan Anda mereka mengutuk garis keturunan Anda. Seorang dokter penyihir Peru pernah mengatakan kepada saya untuk memberi makan kurir saya ke Roshan dan kemudian mati dalam kehidupan nyata. Saya bahkan belum tahu apa itu kurir. Cantik. Kurva belajar? Bayangkan mendaki Gunung Everest, tetapi vertikal, terbakar, dan setengah jalan seseorang melempar ladang ranjau teknisi ke selangkangan Anda. Setiap karakter memiliki 42 kemampuan aktif, pakta setan rahasia, dan komunitas Reddit pasif agresif yang menjelaskan mengapa Anda melakukan semuanya salah. Tidak ada \"meta\"-satu - satunya rasa sakit, dan sepuluh dudes berteriak dalam lima bahasa tentang \"timing item\" sementara menara Anda hancur seperti harga diri Anda. Tapi oh, kompleksitasnya. Strategi. Tinggi yang Anda dapatkan dari mendaratkan lubang hitam lima orang atau menyangkal creep seperti tuan tanah Victoria kecil yang sombong. Saya pernah mendapat tiga pembunuhan dengan penunggang kuda yang menyala saat dilatih pertengahan pertandingan oleh orang Rusia dengan masalah minum dan hati emas. Itu adalah ikatan yang paling saya alami sejak perceraian orang tua saya. Dan grafiknya? Sepertinya koleksi patung - patung Warhammer dimiliki oleh Setan dan dihidupkan kembali menggunakan partikel paruh sisa Valve. Setiap pertandingan terasa seperti mimpi demam yang indah di dalam katedral yang terbakar. Pikiran Terakhir: Dota 2 adalah permainan yang Anda mainkan saat Anda mencapai titik terendah di liga dan memutuskan untuk menggali lebih dalam. Itu tidak memegang tangan Anda. Itu merobek tangan Anda, memberi makan ke hutan creep, dan kemudian menyalahkan Anda karena memberi makan. Ini brutal, menggembirakan, dan hampir pasti bertanggung jawab atas 12% dari penjualan obat tekanan darah global. Saya datang ke sini karena saya dilarang. Saya tinggal karena suara - suara di kepala saya berkata, \"Glhf.\"    10/10. Akan menyala sendiri lagi.",
  "Dota 2 is like a toxic relationship—you hate it, you love it, you can’t quit it. One minute you’re outplaying opponents like a grandmaster, the next you’re getting flamed by a 12-year-old playing Techies. The learning curve? More like a learning cliff. But once you get hooked, there’s no escape.  The gameplay is deep, the heroes are diverse, and every match feels like a new disaster (or masterpiece). Just remember: if you win, it’s all skill. If you lose? Obviously, your team’s fault.  10/10 – Would feed mid again.": "Dota 2 seperti hubungan yang beracun Anda membencinya, Anda menyukainya, Anda tidak bisa berhenti. Satu menit Anda mengalahkan lawan seperti grandmaster, selanjutnya Anda terbakar oleh seorang teknisi bermain berusia 12 tahun. Kurva belajar? Lebih seperti tebing pembelajaran. Tapi begitu Anda ketagihan, tidak ada jalan keluar. Gameplaynya dalam, para pahlawannya beragam, dan setiap pertandingan terasa seperti bencana baru (atau mahakarya). Ingat saja: Jika Anda menang, itu semua keterampilan. Jika Anda kalah? Jelas, kesalahan tim Anda. 10/10 Akan memberi makan pertengahan lagi.",
  "Man, DOTA will always be a good game. The best MOBA for me. Never been bored playing it and always makes me comeback for more. The player based are somewhat toxic but in a competitive way, it only depends on how you view and take it. The time, attention, money and friendship that I manage to make and spend in this game will always be worth it. After playing this game for many years I have decided to quit, hence the review. I am quitting due to medical reasons and I am already too old for game. It's just pure nostalgia that fuels me to continue but it is time to hang up. Enjoy the game, always have a positive mental attitude towards the game and thank you DOTA for all the memories. GGWP!": "Man, Dota akan selalu menjadi permainan yang bagus. MOBA terbaik untukku. Tidak pernah bosan memainkannya dan selalu membuat saya kembali untuk lebih. Berbasis pemain agak beracun tetapi secara kompetitif, itu hanya tergantung pada bagaimana Anda melihat dan mengambilnya. Waktu, perhatian, uang, dan persahabatan yang saya lakukan dan habiskan dalam permainan ini akan selalu sepadan. Setelah bermain game ini selama bertahun - tahun, saya telah memutuskan untuk berhenti, karenanya ulasan. Saya berhenti karena alasan medis dan saya sudah terlalu tua untuk permainan. Hanya nostalgia murni yang memicu saya untuk melanjutkan tetapi sekarang saatnya untuk menutup telepon. Nikmati permainan, selalu memiliki sikap mental yang positif terhadap permainan dan terima kasih Dota untuk semua kenangan. GGWP!",
  "This game taught me about the diversity of cultures that our small little corner of the universe offers. Then it taught me to hate them all.  And it is the best program for learning the Russian language.": "Game ini mengajari saya tentang keragaman budaya yang ditawarkan oleh sudut kecil alam semesta kecil kami. Kemudian itu mengajari saya untuk membenci mereka semua. Dan itu adalah program terbaik untuk mempelajari bahasa Rusia.",
  "Best game, This game make me like at zoo with the entry ticket is my soul, if you never going to zoo this game will give you an experience like at the zoo with so many Animal inside of it.": "Game terbaik, game ini membuat saya seperti di kebun binatang dengan tiket masuk adalah jiwa saya, jika Anda tidak akan pernah ke kebun binatang game ini akan memberi Anda pengalaman seperti di kebun binatang dengan begitu banyak binatang di dalamnya.",
  "I don't even know why I'm still playing  It's like a session to chit-chat with friends while having some side content  Looking back at the hours played, I wonder what would change if I put a quarter of that to piano or something, learning new languages, meeting new people, enjoying different types of art. But all I could do is wonder because you can't change the past. I don't even know if I can change the present because this is a hard addiction.  Despite all those, it's hands down the best MOBA. It's very complex and deep, but that also means it's harder for beginners to learn.  I'll give it a thumbs up. Not many games could take 4000+ hours from me.": "Saya bahkan tidak tahu mengapa saya masih bermain seperti sesi untuk mengobrol dengan teman - teman sementara memiliki beberapa konten sampingan melihat kembali jam yang dimainkan, saya bertanya - tanya apa yang akan berubah jika saya menempatkan seperempat dari itu untuk piano atau sesuatu, belajar bahasa baru, bertemu orang baru, menikmati berbagai jenis seni. Tapi yang bisa saya lakukan hanyalah bertanya - tanya karena Anda tidak dapat mengubah masa lalu. Saya bahkan tidak tahu apakah saya dapat mengubah masa kini karena ini adalah kecanduan yang sulit. Terlepas dari semua itu, itu adalah MOBA terbaik. Ini sangat kompleks dan dalam, tetapi itu juga berarti lebih sulit bagi pemula untuk belajar. Saya akan memberikan jempol. Tidak banyak game yang bisa memakan waktu 4000+ jam dari saya.",
  "✔ Ego simulator ✔ Patience simulator ✔ Instant decision-making simulator ✔ Work environment simulator ✔ Social discrepancy simulator ✔ Anxiety simulator ✔ A game with noticeable RTS elements, not bad. ✔ Anger management simulator ✔ Team building simulator  A highly complex game with weird mechanics. It is a hard game because it's too long and the learning curve is too vast for a starter player. Recommended but play with precaution because it can literally ruin your life or save your life. Double edged sword to say at least.": "✔ Simulator Ego ✔ Simulator Kesabaran ✔ Simulator Pengambilan Keputusan Instan ✔ Simulator Lingkungan Kerja ✔ Simulator Perbedaan Sosial ✔ Simulator Kecemasan ✔ Gim dengan elemen RTS yang terlihat, tidak buruk. ✔ Simulator Manajemen Kemarahan ✔ Simulator Bangunan Tim Game yang sangat kompleks dengan mekanik aneh. Ini adalah permainan yang sulit karena terlalu panjang dan kurva belajar terlalu luas untuk pemain pemula. Direkomendasikan tetapi bermain dengan tindakan pencegahan karena benar - benar dapat merusak hidup Anda atau menyelamatkan hidup Anda. Pedang bermata dua untuk mengatakan setidaknya.",
  "This is quite simply the greatest competitive team based multiplayer game that has ever been created. It is just an exquisite work of art.  The community is toxic. Yes. 10/10": "Ini adalah permainan multipemain berbasis tim kompetitif terbesar yang pernah dibuat. Ini hanya karya seni yang indah. Komunitas itu beracun. Ya. 10/10",
  "This is the game you want to play if you want the heroin fix of league but also the superiority complex of not playing league": "Ini adalah permainan yang ingin Anda mainkan jika Anda menginginkan fix heroin liga tetapi juga kompleks superioritas tidak bermain liga",
  "Strangely, or perhaps not strangely, Deadlock got me into this game, and I have to admit: it's awesome. I am truly terrible at it in every possible respect and am pretty sure I'll never be any good, but the art design is so cool (as usual), and it obviously reminds me of Warcraft III. It's free, and there are so many hero choices that you'll easily find one you'll enjoy playing, even if it's offline with bots. Check it out.": "Anehnya, atau mungkin tidak aneh, Deadlock membuat saya masuk ke permainan ini, dan saya harus mengakui: itu luar biasa. Saya benar - benar mengerikan dalam hal yang mungkin dilakukan dan saya cukup yakin saya tidak akan pernah baik, tetapi desain seni sangat keren (seperti biasa), dan itu jelas mengingatkan saya pada Warcraft III. Ini gratis, dan ada begitu banyak pilihan pahlawan sehingga Anda akan dengan mudah menemukan satu yang akan Anda nikmati, bahkan jika itu offline dengan bot. Lihatlah.",
  "If life seems to be running smoothly, Dota may offer the challenge you seek. It tests the strength of friendships, pushes the limits of one’s patience and decision-making, and introduces a variety of languages—all within the span of a single match.": "Jika kehidupan tampaknya berjalan dengan lancar, Dota mungkin menawarkan tantangan yang Anda cari. Ini menguji kekuatan persahabatan, mendorong batas kesabaran dan pengambilan keputusan seseorang, dan memperkenalkan berbagai bahasa semuanya dalam rentang satu pertandingan.",
  "Ah, Dota 2, the game that's less of a hobby and more of an emotional rollercoaster designed to test your patience, sanity, and keyboard durability! It’s truly a masterpiece in the art of inducing rage while somehow keeping you crawling back for more punishment.    First, let’s talk about the gameplay: What a joy it is to spend 45 minutes meticulously building your hero, only to have one teammate feed the enemy like they're running a charity buffet. Don’t even get me started on the absolute thrill of random matchmaking—because why would you want a balanced game when you can be paired with someone who just discovered what a mouse is?    The graphics? Oh, they’re great! The perfect eye candy to distract you from the existential crisis of watching your ancient crumble while your team argues about whose fault it is in chat. And the community! Such a warm, welcoming group of individuals who will kindly explain, in great detail, how you should uninstall the game after every minor mistake.    But the fun doesn’t stop there! No, because even after losing your 10th ranked match in a row and smashing your personal record for “most rage-induced alt+f4s in a day,” you’ll still come back tomorrow, because there’s always that one perfect game where everything clicks… until it doesn’t.    So yes, Dota 2 is an absolute blast. In the same way that walking barefoot on LEGO bricks is a thrilling experience. Fun? Sure, I guess. Insanity-inducing? Absolutely. 10/10 would recommend to anyone who enjoys suffering disguised as entertainment.": "Ah, Dota 2, permainan yang kurang dari hobi dan lebih dari rollercoaster emosional yang dirancang untuk menguji kesabaran, kewarasan, dan daya tahan keyboard Anda! Ini benar - benar sebuah mahakarya dalam seni mendorong kemarahan sambil entah bagaimana membuat Anda merangkak kembali untuk hukuman lebih. Pertama, mari kita bicara tentang gameplay: Betapa senangnya menghabiskan 45 menit dengan cermat membangun pahlawan Anda, hanya untuk membuat satu rekan setim memberi makan musuh seperti mereka menjalankan prasmanan amal. Bahkan tidak membuat saya memulai sensasi absolut dari perjodohan acak karena mengapa Anda menginginkan permainan yang seimbang ketika Anda dapat dipasangkan dengan seseorang yang baru saja menemukan apa itu mouse? Grafiknya? Oh, mereka hebat! Permen mata yang sempurna untuk mengalihkan perhatian Anda dari krisis eksistensial menyaksikan hancur kuno Anda sementara tim Anda berdebat tentang kesalahan siapa itu dalam obrolan. Dan komunitas! Kelompok individu yang hangat dan ramah yang akan dengan ramah menjelaskan, dengan sangat rinci, bagaimana Anda harus menghapus permainan setelah setiap kesalahan kecil. Tapi kesenangan tidak berhenti di situ! Tidak, karena bahkan setelah kehilangan pertandingan peringkat ke - 10 Anda berturut - turut dan menghancurkan catatan pribadi Anda untuk \"alt+f4s yang paling diinduksi kemarahan dalam sehari,\" Anda masih akan kembali besok, karena selalu ada satu permainan sempurna di mana semuanya diklik ... sampai tidak. Jadi ya, Dota 2 adalah ledakan mutlak. Dengan cara yang sama seperti berjalan tanpa alas kaki di Lego Bricks adalah pengalaman yang mendebarkan. Seru? Tentu, saya kira. Mengesampingkan kegilaan? Sangat. 10/10 akan merekomendasikan kepada siapa saja yang menikmati penderitaan yang disamarkan sebagai hiburan.",
  "With over 3,800 hours poured into Dota 2, I can confidently say this game is more than just a pastime, it's a way of life. Every match is a new challenge, where strategy, teamwork, and skill are constantly put to the test. No two games are ever the same, and that’s what makes it so addicting. The depth of mechanics, hero variety, and the ever-evolving meta keep things fresh even after thousands of hours.  The feeling of executing the perfect team fight, landing that game-changing Black Hole, or carrying your team to victory after a grueling 60-minute battle is unmatched. But on the flip side, the game will test your patience like nothing else. The highs are incredible, but the lows can be brutal. It's a game that rewards dedication and punishes mistakes, making every win feel truly earned.  The community can be intense, and the learning curve is steep, but once you get past the initial struggle, Dota 2 becomes one of the most rewarding experiences in gaming. Whether you're playing casually or grinding ranked, every match teaches you something new. Even after thousands of hours, I still find myself improving and discovering new ways to outplay opponents.  Dota 2 is not just a game, it's a never-ending battle of wits and reflexes that keeps you coming back for more. If you’re willing to invest the time and effort, it’s one of the most satisfying and competitive experiences out there.": "Dengan lebih dari 3.800 jam yang dituangkan ke Dota 2, saya dapat dengan yakin mengatakan bahwa permainan ini lebih dari sekadar hobi, itu adalah cara hidup. Setiap pertandingan adalah tantangan baru, di mana strategi, kerja tim, dan keterampilan terus diuji. Tidak ada dua game yang sama, dan itulah yang membuatnya sangat membuat ketagihan. Kedalaman mekanik, variasi pahlawan, dan meta yang terus berkembang membuat hal - hal segar bahkan setelah ribuan jam. Perasaan melaksanakan pertarungan tim yang sempurna, mendaratkan lubang hitam yang mengubah permainan, atau membawa tim Anda ke kemenangan setelah pertempuran 60 menit yang melelahkan tidak tertandingi. Tetapi di sisi lain, permainan akan menguji kesabaran Anda tidak seperti yang lain. Tinggi luar biasa, tetapi terendah bisa brutal. Ini adalah permainan yang menghargai dedikasi dan menghukum kesalahan, membuat setiap kemenangan terasa benar - benar diperoleh. Komunitas bisa menjadi intens, dan kurva pembelajaran curam, tetapi begitu Anda melewati perjuangan awal, Dota 2 menjadi salah satu pengalaman paling berharga dalam bermain game. Apakah Anda bermain santai atau menempati peringkat, setiap pertandingan mengajarkan Anda sesuatu yang baru. Bahkan setelah ribuan jam, saya masih menemukan diri saya meningkatkan dan menemukan cara baru untuk mengalahkan lawan. Dota 2 bukan hanya permainan, ini adalah pertempuran kecerdasan dan refleks yang tidak pernah berakhir yang membuat Anda kembali lagi. Jika Anda bersedia menginvestasikan waktu dan upaya, itu adalah salah satu pengalaman paling memuaskan dan kompetitif di luar sana.",
  "Best game for a degenerated anti-social person like me. This game has taken almost 10k hours of my lifespan and you still managed being orally abused with word \"Noob\". After 10k hours game play, finally, I realized that everyone is suck except me, I am the main character of this game, this worlds only revolves around for me, because it's always about \"ME, MYSELF, I.  They said, drugs are addictive stuff that could turn downside your life, I think it's a utter bull shiit, this game is worse and outdo any drugs all over the drug market.  And still, I play this game endlessly for hours since the first day this game launced. ": "Game terbaik untuk orang anti sosial yang mengalami kemunduran seperti saya. Game ini telah memakan waktu hampir 10k jam dari umur saya dan Anda masih berhasil dilecehkan secara lisan dengan kata \"noob\". Setelah permainan 10k jam bermain, akhirnya, saya menyadari bahwa semua orang payah kecuali saya, saya adalah karakter utama dari permainan ini, dunia ini hanya berkisar pada saya, karena selalu tentang \"saya, saya, saya mengatakan, obat - obatan adalah hal - hal yang adiktif yang bisa terjadi pada saat ini, saya pikir itu adalah permainan yang lebih buruk.",
  "The game functions 99% of the time, but that 1% when it just gets stuck on Confirming Match for 5 minutes can ruin the whole experience, and if I try to cancel, I get a ban...": "Permainan berfungsi 99% dari waktu, tetapi 1% ketika itu hanya terjebak dalam konfirmasi kecocokan selama 5 menit dapat merusak seluruh pengalaman, dan jika saya mencoba membatalkan, saya mendapat larangan ...",
  "A bit over 4 hours in, and suddenly it's 2am. I was gonna play one game, maybe two. Now my coffee's cold, my cat's judging me, and I'm screaming at strangers on the internet about ward placement. 10/10, would totally sacrifice sleep and sanity again. This game is like an abusive relationship with graphics and the occasional win that keeps you coming back for more. I've lost my social life, my team blames everything on me, and I love it here.  If my MMR is going down, I’m dragging my mental state with it": "Sedikit lebih dari 4 jam, dan tiba - tiba jam 2 pagi. Saya akan memainkan satu pertandingan, mungkin dua. Sekarang kopi saya dingin, kucing saya menilai saya, dan saya berteriak pada orang asing di internet tentang penempatan lingkungan. 10/10, akan benar - benar mengorbankan tidur dan kewarasan lagi. Game ini seperti hubungan yang kasar dengan grafik dan kemenangan sesekali yang membuat Anda kembali lagi. Saya telah kehilangan kehidupan sosial saya, tim saya menyalahkan segalanya pada saya, dan saya menyukainya di sini. Jika MMR saya turun, saya menyeret kondisi mental saya dengannya",
  "Started playing this game because I was gambling on it without having any idea what was going on. Fast forward I have 1600 hours and I am hardstuck 800 mmr because the only people that play are smurfs. I would not trade my experience on this game for anything in the world. Except for my grandma back.": "Mulai memainkan game ini karena saya berjudi di atasnya tanpa tahu apa yang sedang terjadi. Maju cepat saya memiliki 1600 jam dan saya hardcuck 800 mmr karena satu - satunya orang yang bermain adalah smurf. Saya tidak akan menukar pengalaman saya di game ini dengan apa pun di dunia. Kecuali untuk nenek saya kembali.",
  "DOTA is like your toxic ex No matter how toxic it is, You come back to it... toxicity:10/10 braindead team:100/10  Will play again... :)": "Dota seperti mantan beracun Anda tidak peduli seberapa beracunnya, Anda kembali ke sana ... Toksisitas: 10/10 Tim BrainDead: 100/10 Akan Bermain Lagi ... :)",
  "this game's if one of the few thing stopping me from having a perfect relationship save you're self some time and happiest and don't install   10/10 keeps me awake at night": "Game ini jika salah satu dari sedikit hal yang menghentikan saya dari memiliki hubungan yang sempurna kecuali Anda sendiri dan paling bahagia dan tidak menginstal 10/10 membuat saya tetap terjaga di malam hari",
  "Play this, not league: and you will be happier about it in the long term.  I've got 10000 hours in league as well, and this is the better game but dota needs to do better with cinematics and new content/ heroes. Not like a patch every two weeks type deal but i think a patch ever few months at the leaste would keep things more fresh. Once you learnt he game, and what heros and items do, it feels very healthy.": "Mainkan ini, bukan liga: dan Anda akan lebih bahagia tentang hal itu dalam jangka panjang. Saya juga punya 100.000 jam di liga, dan ini adalah permainan yang lebih baik tetapi Dota perlu melakukan lebih baik dengan sinematik dan konten/ pahlawan baru. Tidak seperti tambalan setiap dua minggu kesepakatan tipe tetapi saya pikir tambalan beberapa bulan pada akhirnya akan membuat segalanya lebih segar. Setelah Anda belajar permainan, dan apa yang dilakukan para pahlawan dan barang, rasanya sangat sehat.",
  "the game has evolved so much that it has so much depth to it, and its a very good example of skill caps or brackets where its enjoyable at so many levels.": "Permainan ini telah berkembang begitu banyak sehingga memiliki sangat dalam, dan ini adalah contoh yang sangat baik dari topi atau kurung keterampilan di mana menyenangkan di banyak tingkatan."
}